## Устанавливаем необходимые библиотеки SQL для работы в JN

Устанавливаем MySQL https://dev.mysql.com/downloads/installer/

Устанавливаем необходимые библиотеки:

In [1]:
# !pip install pymysql  # не надо
# !pip install ipython-sql
# !pip install mysqlclient
# !pip install mysql-connector-python  # не надо
# !pip install sqlalchemy

Устанавливаем соединениес MySQL:

In [1]:
import sqlalchemy

In [2]:
sqlalchemy.create_engine("mysql://root:123qwe@localhost/mydb")

Engine(mysql://root:***@localhost/mydb)

In [3]:
%load_ext sql

In [4]:
%sql mysql://root:123qwe@localhost/mydb

## 2.1.6 Задание

Создать таблицу **author** следующей структуры:

In [7]:
%%sql
DROP TABLE IF EXISTS author CASCADE;

CREATE TABLE author(
    author_id   INT PRIMARY KEY AUTO_INCREMENT,
    name_author VARCHAR(50)
);

SELECT *FROM author;

 * mysql://root:***@localhost/mydb
0 rows affected.
0 rows affected.
0 rows affected.

[]

## 2.1.7 Задание

Заполнить таблицу **author**. В нее включить следующих авторов:

* Булгаков М.А.
* Достоевский Ф.М.
* Есенин С.А.
* Пастернак Б.Л.

In [8]:
%%sql
INSERT INTO author (name_author)
VALUES
    ('Булгаков М.А.'),
    ('Достоевский Ф.М.'),
    ('Есенин С.А.'),
    ('Пастернак Б.Л.');

SELECT * FROM author;

 * mysql://root:***@localhost/mydb
4 rows affected.
4 rows affected.

[(1, 'Булгаков М.А.'),
 (2, 'Достоевский Ф.М.'),
 (3, 'Есенин С.А.'),
 (4, 'Пастернак Б.Л.')]

## 2.1.8 Создание таблицы с внешними ключами

Для этого задания создадим таблицу **genre**:

In [12]:
%%sql
DROP TABLE IF EXISTS genre CASCADE;

CREATE TABLE IF NOT EXISTS genre
(
    genre_id   INT PRIMARY KEY AUTO_INCREMENT,
    name_genre TEXT
);

INSERT INTO genre(name_genre)
VALUES ('Роман'),
       ('Поэзия');

SELECT * FROM genre;

 * mysql://root:***@localhost/mydb
0 rows affected.
0 rows affected.
2 rows affected.
2 rows affected.

[(1, 'Роман'), (2, 'Поэзия')]

Перепишите запрос на создание таблицы **book**, чтобы ее структура соответствовала структуре, показанной на логической схеме (таблица **genre** уже создана, порядок следования столбцов - как на логической схеме в таблице **book**, **genre_id**  - внешний ключ) . Для **genre_id** ограничение о недопустимости пустых значений не задавать. В качестве главной таблицы для описания поля **genre_id** использовать таблицу **genre** следующей структуры:

In [13]:
%%sql
DROP TABLE IF EXISTS book CASCADE;

CREATE TABLE book (
    book_id INT PRIMARY KEY AUTO_INCREMENT,
    title VARCHAR(50),
    author_id INT NOT NULL,
    genre_id INT,
    price DECIMAL(8,2),
    amount INT,
    FOREIGN KEY (author_id)  REFERENCES author (author_id),
    FOREIGN KEY (genre_id)  REFERENCES genre (genre_id)
);

SELECT * FROM book;

 * mysql://root:***@localhost/mydb
0 rows affected.
0 rows affected.
0 rows affected.

[]

## 2.1.8 Действия при удалении записи главной таблицы

Создать таблицу **book** той же структуры, что и на предыдущем шаге. Будем считать, что при удалении автора из таблицы **author**, должны удаляться все записи о книгах из таблицы **book**, написанные этим автором. А при удалении жанра из таблицы **genre** для соответствующей записи **book** установить значение **Null** в столбце **genre_id**.

In [14]:
%%sql
DROP TABLE IF EXISTS book CASCADE;

CREATE TABLE book (
    book_id INT PRIMARY KEY AUTO_INCREMENT,
    title VARCHAR(50),
    author_id INT NOT NULL,
    genre_id INT,
    price DECIMAL(8,2),
    amount INT,
    FOREIGN KEY (author_id)  REFERENCES author (author_id) ON DELETE CASCADE,
    FOREIGN KEY (genre_id)  REFERENCES genre (genre_id) ON DELETE SET NULL
);

SELECT * FROM book;

 * mysql://root:***@localhost/mydb
0 rows affected.
0 rows affected.
0 rows affected.

[]

## 2.1.9 Задание

Для этого задания заполним первые 5 строк таблицы **book**:

In [15]:
%%sql
INSERT INTO book(title, author_id, genre_id, price, amount)
VALUES ('Мастер и Маргарита', 1, 1, 670.99, 3),
       ('Белая гвардия', 1, 1, 540.50, 5),
       ('Идиот', 2, 1, 460.00, 10),
       ('Братья Карамазовы', 2, 1, 799.01, 3),
       ('Игрок', 2, 1, 480.50, 10);

 * mysql://root:***@localhost/mydb
5 rows affected.

[]

Добавьте три последние записи (с ключевыми значениями 6, 7, 8) в таблицу **book**, первые 5 записей уже добавлены:

In [16]:
%%sql
INSERT INTO
    book (title, author_id, genre_id,  price, amount)
VALUES
    ('Стихотворения и поэмы', 3, 2, 650.00, 15),
    ('Черный человек', 3, 2, 570.20, 6),
    ('Лирика', 4, 2, 518.99, 2);

SELECT * FROM book;

 * mysql://root:***@localhost/mydb
3 rows affected.
8 rows affected.

[(1, 'Мастер и Маргарита', 1, 1, Decimal('670.99'), 3),
 (2, 'Белая гвардия', 1, 1, Decimal('540.50'), 5),
 (3, 'Идиот', 2, 1, Decimal('460.00'), 10),
 (4, 'Братья Карамазовы', 2, 1, Decimal('799.01'), 3),
 (5, 'Игрок', 2, 1, Decimal('480.50'), 10),
 (6, 'Стихотворения и поэмы', 3, 2, Decimal('650.00'), 15),
 (7, 'Черный человек', 3, 2, Decimal('570.20'), 6),
 (8, 'Лирика', 4, 2, Decimal('518.99'), 2)]